---
kind: property
id: P:Autodesk.Revit.DB.Architecture.RailingType.PrimaryHandrailType
source: html/54e6f2dc-2401-7214-1179-ca825312caca.htm
---
# Autodesk.Revit.DB.Architecture.RailingType.PrimaryHandrailType Property

The type of the primary handrail.

## Syntax (C#)
```csharp
public ElementId PrimaryHandrailType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The handRailTypeId is not a valid hand rail type.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null